dovanviet04112004/esp32s3-face-attendance/firmware/components/net_ota/test_apps/ota/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_UNITY_ENABLE_IDF_TEST_RUNNER=y
CONFIG_COMPILER_STACK_CHECK_MODE_STRONG=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.dev.csv"

# The trial-and-sign case only means anything where the bootloader can undo a slot.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
